#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.yc-vpc.data.yandex_client_config.client: Reading...
module.yc-vpc.data.yandex_client_config.client: Read complete after 0s [id=223147994]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.yc-vpc.yandex_vpc_default_security_group.default_sg[0] will be created
  + resource "yandex_vpc_default_security_group" "default_sg" {
      + created_at  = (known after apply)
      + description = "Default security group"
      + folder_id   = "b1g2inpl68al98r9ock7"
      + id          = (known after apply)
      + labels      = {
          + "created_by" = "terraform-yc-module"
        }
      + name        = (known after apply)
      + network_id  = (known after apply)
      + status      = (known after apply)

      + egress {
          + description    = "To internet"
          + from_port      = -1
          + id             = (known after apply)
          + labels         = (known after apply)
          + port           = -1
          + protocol       = "ANY"
          + to_port        = -1
          + v4_cidr_blocks = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks = []
        }

      + ingress {
          + description       = "Communication inside this SG"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + predefined_target = "self_security_group"
          + protocol          = "ANY"
          + to_port           = -1
          + v4_cidr_blocks    = []
          + v6_cidr_blocks    = []
        }
      + ingress {
          + description    = "ICMP"
          + from_port      = 0
          + id             = (known after apply)
          + labels         = (known after apply)
          + port           = -1
          + protocol       = "ICMP"
          + to_port        = 65535
          + v4_cidr_blocks = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks = []
        }
      + ingress {
          + description       = "NLB health check"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + predefined_target = "loadbalancer_healthchecks"
          + protocol          = "TCP"
          + to_port           = -1
          + v4_cidr_blocks    = []
          + v6_cidr_blocks    = []
        }
      + ingress {
          + description    = "RDP"
          + from_port      = -1
          + id             = (known after apply)
          + labels         = (known after apply)
          + port           = 3389
          + protocol       = "ANY"
          + to_port        = -1
          + v4_cidr_blocks = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks = []
        }
      + ingress {
          + description    = "ssh"
          + from_port      = -1
          + id             = (known after apply)
          + labels         = (known after apply)
          + port           = 22
          + protocol       = "ANY"
          + to_port        = -1
          + v4_cidr_blocks = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks = []
        }
    }

  # module.yc-vpc.yandex_vpc_gateway.egress_gateway[0] will be created
  + resource "yandex_vpc_gateway" "egress_gateway" {
      + created_at = (known after apply)
      + folder_id  = "b1g2inpl68al98r9ock7"
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = "ai-radio-network-egress-gateway"

      + shared_egress_gateway {}
    }

  # module.yc-vpc.yandex_vpc_network.this[0] will be created
  + resource "yandex_vpc_network" "this" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + description               = "Basic network for ai-radio app"
      + folder_id                 = "b1g2inpl68al98r9ock7"
      + id                        = (known after apply)
      + labels                    = {
          + "created_by" = "terraform-yc-module"
        }
      + name                      = "ai-radio-network"
      + subnet_ids                = (known after apply)
    }

  # module.yc-vpc.yandex_vpc_route_table.private[0] will be created
  + resource "yandex_vpc_route_table" "private" {
      + created_at = (known after apply)
      + folder_id  = "b1g2inpl68al98r9ock7"
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = "ai-radio-network-private"
      + network_id = (known after apply)

      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
        }
    }

  # module.yc-vpc.yandex_vpc_subnet.private["10.10.0.0/24"] will be created
  + resource "yandex_vpc_subnet" "private" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = {
          + "created_by" = "terraform-yc-module"
        }
      + name           = "subnet-1"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "10.10.0.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"

      + dhcp_options {
          + domain_name         = "internal."
          + domain_name_servers = []
          + ntp_servers         = []
        }
    }

  # module.yc-vpc.yandex_vpc_subnet.private["10.11.0.0/24"] will be created
  + resource "yandex_vpc_subnet" "private" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = {
          + "created_by" = "terraform-yc-module"
        }
      + name           = "subnet-2"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "10.11.0.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"

      + dhcp_options {
          + domain_name         = "internal."
          + domain_name_servers = []
          + ntp_servers         = []
        }
    }

  # module.yc-vpc.yandex_vpc_subnet.private["10.12.0.0/24"] will be created
  + resource "yandex_vpc_subnet" "private" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = {
          + "created_by" = "terraform-yc-module"
        }
      + name           = "subnet-3"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "10.12.0.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-d"

      + dhcp_options {
          + domain_name         = "internal."
          + domain_name_servers = []
          + ntp_servers         = []
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @valeter, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Yandex Cloud Integration check`*